# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'htop'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts
brew 'tree'
brew 'wget'
brew 'youtube-dl'

# Development
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'bitwarden'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'notion'
cask 'pastebot'
cask 'postman'
cask 'rectangle'
cask 'screenflow'
cask 'scroll-reverser'
cask 'slack'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tuple'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Fantastical', id: 975937182
mas 'Logic Pro', id: 634148309
